app/views/groups/show.html.erb

SELECT "games".* FROM "games" WHERE "games"."group_id" = $1  [["group_id", 1]]
---
<ul>
  <% @group.games.each do |game| %>