app/views/games/show.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<h2><%= @game.title %> <%= link_to "(edit)", edit_group_game_path(@game.group, @game) %></h2>