app/controllers/games_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @group = Group.find(params[:group_id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "games" ("name", "group_id") VALUES ($1, $2) RETURNING "id"  [["name", "test"], ["group_id", 1]]
---
  def create
    @group = Group.find(params[:group_id])
    @group.games.create(game_params)

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @group = Group.find(params[:group_id])
    @game = Game.find(params[:id])

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @group = Group.find(params[:group_id])
    @game = Game.find(params[:id])